/*
Задание: Дан массив с числами. Выведите последовательно его элементы используя рекурсию и не используя цикл.
*/


public class Main {
    public static void main(String[] args) {
        int num[] = {4,2,6,2,65};
                System.out.println(num[0]);
                System.out.println(num[0+1]);
                System.out.println(num[0+2]);
                System.out.println(num[0+3]);
                System.out.println(num[0+4]);
    }
}
